[
    {
        "company": "Tobacco SG",
        "title": "Sales Attendant",
        "period": "Sep 2022 to now",
        "activity": [
          "Demonstrated efficiency in financial transaction using POS with 0% error",
          "Exceed customer satisfaction with effective communication",
          "Created a proper documentation by writing reports in the given format with 100% consistency.",
          "Demonstrated effective project management skills by using company documentation templates. "
        ]
      },
      {
        "company": "MITRA AGUNG",
        "title": "IT Freelancer",
        "period": " Jan 2017 to now",
        "activity": [
          "Established proper data design and structure by using excel files",
          "Composed a small database using google drive for cost effective data storing",
          "Designing the data design and structure for the software",
          "Prototyped a solution for the problem using a third-party software"
        ]
      },
      {
        "company": "Javier Garcia Lopez, Brisbane, QLD",
        "title": "IT Freelancer Contract",
        "period": "Sep 2023 to Oct 2023",
        "activity": [
          "Establish Docker Compose connectivity with an AWS EC2 instance",
          "Facilitate the deployment of both the backend and frontend systems on the client's computer.",
          "Contribute to the development of React JavaScript components for the frontend.",
          "Successfully resolve deployment-related system issues and bugs"
        ]
      },
      {
        "company": "Javier Garcia Lopez, Brisbane, QLD",
        "title": "IT Freelancer Contract",
        "period": "Oct 2023 to Nov 2023",
        "activity": [
          "Oversee backend deployment and AWS service management",
          "Implement server scaling through AWS Auto Scaling groups",
          "Utilize Amazon Relational Database Service for data storage",
          "Created project documentation"
        ]
      },
      {
        "company": "QUT",
        "title": "Blockchain-Based Assessment Ledger Website",
        "period": "Jan 2022 to Jun 2022",
        "activity": [
          "In this website, student can generate a report that can show all the skills they have learn from the courses and all the data will be stored in the blockchain to ensure security.",
          "Demonstrated skills in JavaScript front-end development",
          "Achieved success in testing SDN using Linux virtual OS",
          "Used Trello for quality control"
        ]
      },
      {
        "company": "QUT",
        "title": "Gamified Entrepreneur Dashboard",
        "period": "Jan 2019 to Jan 2020",
        "activity": [
          "Created a dashboard that can deliver an interesting gamification process for the participants that wants to hold an entrepreneurship program and allows the staff to track and analyze the experiences of the participants",
          "Designed front end of the website with HTML and CSS",
          "Implemented back end of the website with Phyton",
          "Organized workflow using SCRUM method",
          "Documented the coding Done on the project",
          "Designed database using SQL",
          "Fixed bugs during the development of the dashboard."
        ]
      },
      {
        "company": "UBAYA (University Of Surabaya)",
        "title": "Final Exams Scheduling Website",
        "period": "Jan 2018 to Jan 2019",
        "activity": [
          "Created a website that is used to schedule final exam for the students in UBAYA",
          "Implemented PHP for backend development ",
          "Designed the front-end using HTML"
        ]
      },
      {
        "company": "Queensland University of Technology",
        "title": "IFN666 Assessment 2 Project",
        "period": "Jan 2022 to Jun 2022",
        "activity": [
          "Successfully created a website designed to monitor and analyse stock market fluctuation using both financial modelling prep and alpha vantage APIs.",
          "Demonstrated skills in JavaScript front-end development",
          "Demonstrated proper use of API to get stock prices data and visualize them properly on the website."
        ]
      },
      {
        "company": "Queensland University of Technology",
        "title": "IFN666 Assessment 3 Project",
        "period": "Jan 2022 to Jun 2022",
        "activity": [
          "Successfully created a mobile app based on the IFN666 assessment 2 designed to monitor and analyse stock market fluctuation using both financial modelling prep and alpha vantage APIs",
          "Demonstrated skills in React Native JavaScript",
          "Demonstrated proper use of API to get stock prices data and visualize them properly in the website."
        ]
      },
      {
        "company": "YESTERDAY’S THRIFT SHOP",
        "title": "Volunteer",
        "period": "Sep 2022 to Mar 2023",
        "activity": [
          "Handles customer service",
          "Handles Stock Rotation",
          "Handles Stock pricing",
          "Handles Merchandising"
        ]
      }
  ]
  